Revit 2027 API
AnalysisDisplayColorSettings Constructor
 Constructs a default instance of color settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColorSettings()
Public Sub New
public:
AnalysisDisplayColorSettings()
new : unit -> AnalysisDisplayColorSettings
See Also
Reference
AnalysisDisplayColorSettings Class
AnalysisDisplayColorSettings Overload
Autodesk.Revit.DB.Analysis Namespace